progress.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-09-29 Mon 19:37 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>URL Poller Project Progress Report</title>
<meta name="author" content="Prem Modha" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">URL Poller Project Progress Report</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org64263bd">1. Project Overview</a>
<ul>
<li><a href="#org78be950">1.1. Project Details</a></li>
<li><a href="#orgb495855">1.2. Description</a></li>
</ul>
</li>
<li><a href="#org0dc0ccd">2. Technical Architecture</a>
<ul>
<li><a href="#org9132285">2.1. Core Components</a>
<ul>
<li><a href="#org29c83c1">2.1.1. MainVerticle.java</a></li>
<li><a href="#org0073252">2.1.2. ConfigReaderVerticle.java</a></li>
<li><a href="#orgafa552b">2.1.3. TaskSchedulerVerticle.java</a></li>
<li><a href="#org57697cd">2.1.4. PingVerticle.java</a></li>
<li><a href="#orgaa5ceb7">2.1.5. WorkerVerticle.java</a></li>
<li><a href="#org98439f8">2.1.6. Ip.java</a></li>
<li><a href="#orga0b9166">2.1.7. Event System</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orga9f4559">3. diasg</a></li>
</ul>
</div>
</div>
<div id="outline-container-org64263bd" class="outline-2">
<h2 id="org64263bd"><span class="section-number-2">1.</span> Project Overview</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org78be950" class="outline-3">
<h3 id="org78be950"><span class="section-number-3">1.1.</span> Project Details</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li><b>Project Name</b>: URL/IP Poller (Vert.x Application)</li>
</ul>
</div>
</div>
<div id="outline-container-orgb495855" class="outline-3">
<h3 id="orgb495855"><span class="section-number-3">1.2.</span> Description</h3>
<div class="outline-text-3" id="text-1-2">
<p>
A distributed URL polling system built with Eclipse Vert.x that monitors multiple IP addresses by sending ping requests at configurable intervals. The application uses a verticle-based architecture for concurrent processing and maintains statistics for each monitored endpoint.
</p>
</div>
</div>
</div>
<div id="outline-container-org0dc0ccd" class="outline-2">
<h2 id="org0dc0ccd"><span class="section-number-2">2.</span> Technical Architecture</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org9132285" class="outline-3">
<h3 id="org9132285"><span class="section-number-3">2.1.</span> Core Components</h3>
<div class="outline-text-3" id="text-2-1">
</div>
<div id="outline-container-org29c83c1" class="outline-4">
<h4 id="org29c83c1"><span class="section-number-4">2.1.1.</span> MainVerticle.java</h4>
<div class="outline-text-4" id="text-2-1-1">
<ul class="org-ul">
<li>Entry point of the application</li>
<li>Deploys ConfigReaderVerticle and TaskSchedulerVerticle</li>
<li>Handles command-line argument for configuration file path</li>
</ul>
</div>
</div>
<div id="outline-container-org0073252" class="outline-4">
<h4 id="org0073252"><span class="section-number-4">2.1.2.</span> ConfigReaderVerticle.java</h4>
<div class="outline-text-4" id="text-2-1-2">
<ul class="org-ul">
<li>Reads URL configuration from file (urls.txt)</li>
<li>Parses IP addresses with polling intervals</li>
<li>Publishes CONFIG<sub>LOADED</sub> event when configuration is ready</li>
</ul>
</div>
</div>
<div id="outline-container-orgafa552b" class="outline-4">
<h4 id="orgafa552b"><span class="section-number-4">2.1.3.</span> TaskSchedulerVerticle.java</h4>
<div class="outline-text-4" id="text-2-1-3">
<ul class="org-ul">
<li>Listens for CONFIG<sub>LOADED</sub> events</li>
<li>Groups IP addresses by polling intervals</li>
<li>Creates periodic tasks for each polling interval group</li>
<li>Deploys PingVerticle instances for scheduled execution</li>
</ul>
</div>
</div>
<div id="outline-container-org57697cd" class="outline-4">
<h4 id="org57697cd"><span class="section-number-4">2.1.4.</span> PingVerticle.java</h4>
<div class="outline-text-4" id="text-2-1-4">
<ul class="org-ul">
<li>Handles a set of IP addresses with same polling interval</li>
<li>Deploys WorkerVerticle instances for parallel ping execution</li>
<li>Uses worker thread pool for non-blocking operations</li>
</ul>
</div>
</div>
<div id="outline-container-orgaa5ceb7" class="outline-4">
<h4 id="orgaa5ceb7"><span class="section-number-4">2.1.5.</span> WorkerVerticle.java</h4>
<div class="outline-text-4" id="text-2-1-5">
<ul class="org-ul">
<li>Executes ping command for individual IP addresses</li>
<li>Captures stdout and stderr from ping process</li>
<li>Writes results to individual files in stats/ directory</li>
<li>Implements proper error handling and resource cleanup</li>
</ul>
</div>
</div>
<div id="outline-container-org98439f8" class="outline-4">
<h4 id="org98439f8"><span class="section-number-4">2.1.6.</span> Ip.java</h4>
<div class="outline-text-4" id="text-2-1-6">
<ul class="org-ul">
<li>Data model for IP address and polling interval</li>
<li>Implements Comparable and Serializable interfaces</li>
<li>Includes Jackson annotations for JSON serialization</li>
</ul>
</div>
</div>
<div id="outline-container-orga0b9166" class="outline-4">
<h4 id="orga0b9166"><span class="section-number-4">2.1.7.</span> Event System</h4>
<div class="outline-text-4" id="text-2-1-7">
<ul class="org-ul">
<li>Event.java: Defines application events (CONFIG<sub>LOADED</sub>)</li>
<li>EventHandler.java: Manages event publishing and consumption</li>
<li>Provides decoupled communication between verticles</li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-orga9f4559" class="outline-2">
<h2 id="orga9f4559"><span class="section-number-2">3.</span> diasg</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">
<pre class="src src-mermaid">flowchart TD
    A[MainVerticle&lt;br/&gt;Entry Point] --&gt;|deploys| B[ConfigReaderVerticle]
    A --&gt;|deploys| C[TaskSchedulerVerticle]

    B --&gt;|reads urls.txt&lt;br/&gt;parses IPs| D[CONFIG_LOADED Event]
    B --&gt; EventSystem

    C --&gt;|listens for CONFIG_LOADED| D
    C --&gt;|groups IPs by interval&lt;br/&gt;creates periodic tasks| E[PingVerticle Instances]
    C --&gt; EventSystem

    E --&gt;|deploys for parallel execution| F[WorkerVerticle Instances]
    E --&gt;|handles set of IPs| G[Ping Execution]

    F --&gt;|executes ping for IP| H[Capture stdout/stderr&lt;br/&gt;Error Handling]
    F --&gt;|writes results| I[stats/ Directory Files]

    EventSystem[Event System&lt;br/&gt;Event.java &amp; EventHandler.java]
    EventSystem &lt;--&gt; B
    EventSystem &lt;--&gt; C

    IpModel[Ip.java&lt;br/&gt;Data Model]
    IpModel --&gt; B
    IpModel --&gt; C
    IpModel --&gt; F

    style A fill:#f9f,stroke:#333
    style EventSystem fill:#bbf,stroke:#333

</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: September 29, 2025</p>
<p class="author">Author: Prem Modha</p>
<p class="date">Created: 2025-09-29 Mon 19:37</p>
</div>
</body>
</html>
